Revit 2015 API
CustomExporter.Export Method (View3D)
 Exports one 3-D view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public void Export(
	View3D view
)
Visual Basic
Public Sub Export ( _
	view As View3D _
)
Visual C++
public:
void Export(
	View3D^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View3D
 An instance of the 3-D view to export
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The view is not exportable, such as a template view, for example.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The instance of IExportContext is not valid. -or- Rendering is currently not supported in the running instance of Revit. One reason for that to happen is that rendering and material libraries are not currently available.
See Also
CustomExporter Class
Export Overload
Autodesk.Revit.DB Namespace